{
	"type":"NPCSamantha",
	"name":"Samantha",
	"outfit":{
		"top":["lacybra", "samdress"],
		"bottom":["lacythong", "garters", "heels"]
	},
	"trophy":"SamanthaTrophy",
	"stats":{
		"base":{
			"level":12,
			"attributes":{
				"Seduction":20,
				"Cunning":6,
				"Power":6,
				"Technique":8
			},
			"resources":{
				"stamina":60,
				"mojo":100,
				"arousal":200,
				"willpower":100
			},
			"traits":[
				"temptress",
				"limbTraining1",
				"tongueTraining1",
				"pussyTraining1",
				"dickhandler"
			]
		},
		"growth":{
			"resources":{
				"stamina":1,
				"bonusStamina":1,
				"mojo":2,
				"bonusMojo":1,
				"arousal":3,
				"bonusArousal":1,
				"willpower":1.5,
				"bonusWillpower":0.5,
				"points":[2, 3, 3],
				"bonusPoints":1
			},
			"traits":[{
					"level":14,
					"trait":"silvertongue"
				},{
					"level":17,
					"trait":"limbTraining2"
				},{
					"level":20,
					"trait":"tongueTraining2"
				},{
					"level":23,
					"trait":"pussyTraining2"
				},{
					"level":26,
					"trait":"alwaysready"
				},{
					"level":29,
					"trait":"desensitized"
				},{
					"level":32,
					"trait":"experttongue"
				},{
					"level":35,
					"trait":"insertion"
				},{
					"level":38,
					"trait":"autonomousPussy"
				},{
					"level":41,
					"trait":"powerfulhips"
				},{
					"level":44,
					"trait":"limbTraining3"
				},{
					"level":47,
					"trait":"tongueTraining3"
				},{
					"level":50,
					"trait":"pussyTraining3"
				}
			],
			"preferredAttributes":[{
					"attribute":"Technique",
					"max":30
				}, {
					"attribute":"Seduction"
				}
			]
		}
	},
	"plan":"hunting",
	"sex":"female",
	"body":{
        "parts":[
          {
            "class":"nightgames.characters.body.BreastsPart",
            "enum":"d"
          },
          {
            "class":"nightgames.characters.body.PussyPart",
            "enum":"normal"
          },
          {
            "class":"nightgames.characters.body.EarPart",
            "enum":"normal"
          },
          {
          	"class":"nightgames.characters.body.AssPart",
          	"desc":"ass",
          	"hotness":0.5,
          	"pleasure":1.2,
          	"sensitivity":1.0
          },
          {
          	"class":"nightgames.characters.body.MouthPart",
          	"desc":"mouth",
          	"hotness":0.0,
          	"pleasure":1.2,
          	"sensitivity":1.0
          },
          {
            "descLong":"",
            "pleasure":1.0,
            "prefix":"",
            "notable":false,
            "sensitivity":1.0,
            "hotness":0.0,
            "type":"skin",
            "class":"nightgames.characters.body.GenericBodyPart",
            "desc":"skin"
          },
          {
            "descLong":"",
            "pleasure":1.0,
            "prefix":"",
            "notable":false,
            "sensitivity":1.0,
            "hotness":0.0,
            "type":"hands",
            "class":"nightgames.characters.body.GenericBodyPart",
            "desc":"hands"
          },
          {
            "descLong":"",
            "pleasure":1.0,
            "prefix":"",
            "notable":false,
            "sensitivity":1.0,
            "hotness":0.0,
            "type":"feet",
            "class":"nightgames.characters.body.GenericBodyPart",
            "desc":"feet"
          }
        ],
        "hotness":1.5
      },
	"items":{
		"initial":[{
				"item":"nectar",
				"amount":10
			}
		],
		"purchase":[{
				"item":"nectar",
				"amount":10
			}
		]
	},
	"lines":{
		"hurt":[{
				"text":"Oh, a bit of a masochist, are we? That's alright, I cater to all tastes! "
			}
		],
		"naked":[{
				"requirements":{
					"reverse":{"dom":""}
				},
				"text":"Are you going to fuck me now? I promise my pussy will be a welcoming host. Why don't you give her a try? "
			},{
				"text":"Samantha strikes a stunning pose as the last of her body is uncovered. \"All this could be yours, you know. You just need to cum a few times for me first.\""
			}
		],
		"stunned":[{
				"text":"I much prefer the gentler kind of love, but if this is what you want, it's what you'll get! "
			}
		],
		"taunt":[{
				"text":"I think I might try and see how effective pain is for you. Of course, I might have to really crank it up to get a good reaction... "
			}
		],
		"tempt":[
			{
				"requirements":{
					"inserted":true
				},
				"text":"Does that feel good? Why don't you just lie back and let me take care of you? "
			},
			{
				"text":"Hmm, the things I'm going to do to you! If you relax, I'll show you why people pay fortunes to spend a night with me! "
			}
		],
		"orgasm":[
		{
				"requirements":{
					"reverse":{
						"orgasms":2
					}
				},
				"text":"Oh, yes! You really are good at this! Ever considered going pro?"
			},
			{
				"requirements":{
					"reverse":{
						"orgasms":1
					}
				},
				"text":"Ah! It's not often I get multiple orgasms on the job! Do keep it up! "
			},
			{
				"text":"Mmm, nice job! Guess I will just have to work a little harder!"
			}
		],
		"makeOrgasm":[
			{
				"requirements":{
					"reverse":{
						"orgasms":2
					}
				},
				"text":"That's some stamina you've got! Surely, though, you're almost done now, right?"
			},
			{
				"requirements":{
					"reverse":{
						"orgasms":1
					}
				},
				"text":"And another!  Think you are up for another round? "
			},
			{
				"text":"Good! Now we can really begin! Try to last a bit longer this time, huh? More fun for both of us! "
			}
		],
		"describe":[{
				"text":"Looking at Samantha, it's immediately obvious why she's so popular among the filthy rich. Her every curve is perfectly proportioned, her skin completely unblemished, her long hair a red so dark it's almost purple and with a satin shine. Her every action oozes sensuality, and the mischievous glint in her eyes tells you that she has no doubt she'll have you begging for her to finish you off in record time. "
			}
		],
		"startBattle":[{
				"text":"<i>\"Ah, there you are. I wanted to show my appreciation for your patronage. Oh yes, only the finest will do for you...\"</i>"
			}
		],
		"night":[{
				"text":"TODO_NIGHT"
			}
		],
		"victory":[{
				"requirements":
				{
					"result":"anal",
					"inserted":true
				},
				"text":"TODO_VIC_ANAL_PITCH"
			}, {
				"requirements":
				{
					"result":"anal",
					"reverse":{"inserted":true}
				},
				"text":"TODO_VIC_ANAL_CATCH"
			}, {
				"requirements":
				{
						"result":"intercourse"
					}
				,
				"text":"You are so, so close to erupting inside Samantha, but she is equally close! You close your eyes and try to distract yourself, moving mechanically and exciting yourself as little as possible. She's struggling too, thrashing her head and moaning in pleasure. Then she screams out and goes stiff. Confident in your victory, you open the floodgates and pump into her with a feral wildness. It takes only seconds of powerful thrusting, spurred on by her impassioned sounds, for you to reach the point of no return. Just as you do, she goes limp and quiet, simply smiling at you. You realize you've been tricked, but it's too late to stop now. You give one last thrust with all your might, pouring all your lust and frustration into her, soon followed by powerful torrents of thick cum. Even as you groan in her ear, she just laughs.\n\"If only you knew how often I have had to fake an orgasm, {player:do-name}, you would understand how I have gotten so good at it. Don't feel too bad, though, I was actually quite close. On that note...\"\nShe locks her arms and legs around you and rolls the both of you over. \"... You still owe me one.\" That may be so, but at least one part of you seems to disagree. Your cock lies limp across your thigh, and it's not going anywhere soon after that workout. Following your gaze, Samantha sees the problem. \"Do you know something that I have to do even more often than faking orgasms? This.\" She ducks on a finger for a moment, then aims it between your legs and shoves it up your ass. She starts moving it around as if looking for something, and it's already having a bit of an effect. \"Now where... Ah! There you are!\" Her finger is pressed right up against your prostate, and she is pressing down hard on it. At the same time, her other hand as found your dick, and it's trying to coax some life into it. Under the combined assault, it doesn't take long for her to succeed. \"Always works like a charm,\" she smugly states. With your tumescence restored, she aims it up and sits down, taking all of you in one go.\nDespite her being focused primarily on her own pleasure, after a few minutes she still hasn't reached her peak. You, on the other hand, are getting quite close again. This does not escape her notice. Impassioned, she shouts:\"Don't you fucking dare cum first this time! You owe me this, and I swear if you don't deliver I will find the biggest rod I can and shove it so far up your ass you'll taste it!\" If it weren't for her velvety smooth walls still gripping your dick, it would have gone soft at the prospect. It did ease you away from the brink, however, and after a short while Samantha finally has her orgasm. Her spasming muscles and the impossibly cute sounds she produces push you over the end as well, exploding inside of her in the wake of her own climax. \"Sorry I got a bit rough back there, but I find a bit of fear greatly improves stamina. That's not to say I wouldn't have been mad, of course. You would have suffered.\" \"Anyway,\" she says, getting up, \"we're even, for now. So I guess I will see you around, huh? I'm looking forward to it!\" With that she walks of, collecting her clothes and yours as she does."
			}, {
				"text":"You're not going to last much longer, and you're certain that Samantha knows it. Every movement she makes exudes complete confidence, augmented by her wicked grin. She dashes past you, running a hand over your dick as she does, and grabs you from behind. You try to break away, but she has a good hold on one of your arms and she twists it painfully whenever you try to break away. \"Now, now, {other:do-name}. Just stay still. We both know I've already won.\" As much as it pains you to admit it, you know she's right. Sensing your reluctant acquiescence, she grabs your swollen cock and starts jerking it slowly, yet deliberately. You are so very close, but she somehow manages to keep you right on the edge without pushing you over. There must have been a questioning tone to your quiet grunts, because Samantha answers your unasked question. \"I'm not going to let you cum until you ask me nicely. It's not difficult, really: 'Please, Samantha, please let me cum.' That's all there is to it. Just ask, and it shall be given.\"\n\nNo way. No way in hell are you going to say that. In an act of defiance, you slip your free arm behind your back, trying to get at her pussy. Samantha releases your dick and grabs your balls instead, squeezing tightly. \"Uh, Uh. This is your party. But if you just ask me one teensy tiny question, I will let you play with her as much as you want afterwards.\" Desperate to be free of the pain, you pull your arm back, and Samantha's grip shifts back to your shaft. If anything, the sudden pain brought you back from the brink. She soon has you right back there, though. Your copious precum is only making her job easier, and despite your best efforts you cannot bite back the occasional groan. You try to hump against her hand, trying to get just that little extra friction so you can cum without asking, but she compensates immediately, perfectly sensing how to keep you in line. You do what you can to hide your arousal, hoping that she might underestimate it and push you over the edge accidentally, but she will not be fooled. After a few torturous minutes, you can last no more. You sputter the first syllables, as if half your brain is still resisting. \"What's that love? Did you want to ask me something?\" You shout out the question, as loud and fast as you can, as if it would leave a bad taste in your mouth were it allowed to linger. \"See, that wasn't too difficult, right? Here you go.\" Samantha starts pumping her hand back and forth at full speed, and in mere seconds you unleash a huge load all over the ground. You slump in Samantha's arms, and she gently lays you down. \"I'll take a rain check on that fingering you owe me, I don't think you'd be much good right now. See you later!\" Your vision clears just in time to see her wonderful ass swaying off into the distance. "
			}
		],
		"defeat":[{
				"text":"TODO_LOSS_DEFAULT"
			}
		],
		"draw":[{
				"text":"TODO_DRAW_DEFAULT"
			}
		],
		"victory3p":[{
				"text":"Samantha squats down in front of you, and you immediately cease your struggling at the sight of her shapely bosom. \"Good boy. Why don't we see if I can't have a little fun with you?\" She gets on her knees and leans in, kissing you softly. Meanwhile, her hands roam over your chest, her fingers working magic on your nipples. You had grown flaccid after {other:name} arrived, but just these simple touches are getting you rock hard again. Of course, her soft tongue dexterously exploring your mouth also helps. She keeps her body at some distance, careful never to make contact with you your turgid shaft. She moves her head down to one of your nipples, bringing the hand that was there down to your stomach. Her hand deftly scurries across your lower body, pressing down on your lower belly, tickling your sides and lightly drawing patterns over your abs, but still not laying a finger on the painfully swollen head of your cock. Every touch down below is accentuated by a caress, a suckle, a pull or even a light nibble on your nipples, and they seem to have a direct connection to your balls. You start to think you might actually cum just from this, and you start thinking about other things, trying to distract yourself and at least have her jerk you off to get her win. A couple of minutes pass, during which she never repeats the same combination of attentions twice, always bombarding you with new and wonderful sensations. Just when you think you are no longer able to hold on, she suddenly stops. \"Really impressive, {other:name}. Most guys cum after two minutes at most. Guess I'll just have to give your friend down there some direct attention. Unless...\" She lays down in front of you, resting her chin on her wrists, right in front of your dick. Then she purses her lips and softly blows. The feeling is so light, so immaterial, that you normally probably wouldn't have felt it. Now, however, it's just enough to send you into a screaming climax. You throw your head back and squeeze your eyes shut as your cock erupts. The final proof of your defeat soars through the air, nearly coating your own face. When your orgasm finally dies down, you are barely aware of being lain down on the ground and Samantha and {other:name} walking of, and you honestly don't care. "
			}],
		"victory3pAssist":[{
				"text":"Samantha takes a moment to consider the situation, with you offering up {other:name} as you are. \"Hmm, I guess I could just finger you and be done with it, but where's the fun in that? Besides, I should get something out of this too. But how to best... Ah! Perfect!\" She moves in a blur, and somehow ends up with her legs wrapped around both your and {other:name-possessive} heads, pressing her pussy into her face while she dives in between {other:name-possessive} spread legs. You can't see what's going on down there, but being pressed up against {other:name} like this you can certainly feel the effects it has. She is twitching and squirming in your arms, and you have to work to hold on to her. Her moans grow to muffled screams as Samantha works her magic with her talented tongue. You count three orgasms before Samantha comes up for air, though it might have been a single long one. \"Well go on, honey. From now on you don't get to cum unless I do, I'll just get you really close until you get me off.\" {other:name} dives in with a vengeance as Samantha goes back down. Just the smell of Samantha's pussy so close to you has you hard as a rock against {other:name-possessive} back, and her swirling tongue occasionally splatters some of those sweet juices your way. You hear Samantha let out a soft moan, and immediately every muscle in {other:name-possessive} body tenses up as she screams her ecstasy into Samantha's squirting cunt. Both girls collapse into a heap as you stand, still painfully hard from the smell and {other:name-possessive} squirming. Samantha, of course is the first to rise. \"Well that was fun,\" she says looking down at {other:name}, \"I could have you curled up and panting like that too, you know. But let's make it a fair match this time, huh?\" "
			}
		],
		"intervene3p":[{
				"text":"Your fight against {other:name} is going rather well, and you've got her on her stomach with you on top of her. Suddenly, a weight settles on your back, and when you look to the side, you are greeted by Samantha's face. She's lain down on top of you, pressing her thighs against yours and caressing your sides with her hands. \"You don't mind if I join in, do you? I always enjoy threesomes.\" You do mind, so you roll over, ending up atop her with both of you on your backs. She wraps her limbs around you holding you firmly in place. \"Go ahead,\" she says to {other:name}, who has gotten up by now, \"Have at him! I'll just wait for my turn.\""
			}
		],
		"intervene3pAssist":[{
				"text":"{other:name} has gotten you in a bit of a pinch here. You already came once and are steaming towards a second, and she doesn't show any signs of being remotely close yet. You lunge at her, but even as you do so you know she's going to counter it and bring you down. Then she freezes, looking at something behind you, and your attack connects. You are now sitting on her thighs as she is sprawled out beneath you, and then Samantha leisurely strolls by, ostensibly the cause of {other:name-possessive} distraction. She plants herself on {other:possessive-pronoun} chest, pinning her arms above her head. Samantha looks over her shoulder at you. \"Well go on, get her off and I will be able to do you next.\""
			}
		]
	},
	"mood":{
		"dominant":100,
		"nervous":50,
		"angry":100,
		"confident":100,
		"horny":100,
		"desperate":50
	},
	"recruitment":{
		"action":"Samantha:$1000",
		"requirements":{
			"level":10
		},
		"cost":[
			{"modMoney":-1000}
		],
		"introduction":"So, I know this girl, an old friend of mine who now works as a high-class escort. She doesn't have any of that magical or technological stuff, but I swear she could get my dear old grandfather to cream his pants just by winking at him the right way. And he's dead! Anyway, you might have heard about her. She got into a bit of trouble recently after an entrepreneuring paparazzo sniped a picture of her and some prince or another going at it. Now she's got to lay low for a bit, lest mommy dearest arranges for an 'accident'. So I told her about this thing we've got going here, and she got super excited at the prospect. So much so that she's agreed to come over for a fraction of her usual rate. Girl's got to eat, I suppose. She even gave me a free blowjob for making the suggestion! Let me tell you, those were six of the finest seconds of my life! Oh, think that's funny, do you? Pay up and see how long you last!",
		"confirm":"Awesome, I'll go give her a call right now. Might even get another freebie out of it! I'll make sure to mention your name, too. Careful, she might want to thank you! "
	},
	"portraits":[
	],
	"defaultPortrait":"angel_confident.png"
}
